IDEA Open Model
ConnectionSetup.AnchorLengthForStiffness Property
Compatible with IDEA StatiCa Beta 20.0
 Length of anchor to define the anchor stiffness in analysis model, as a multiple of anchor diameter (E A /n * [d])
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public int AnchorLengthForStiffness { get; set; }
Public Property AnchorLengthForStiffness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ConnectionSetup Class
IdeaRS.OpenModel Namespace